pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/LEA_SC_367.0.xml
    <register id="LEASCPMCB" width="32" offset="0x50" internal="0" description="PM Command Buffer Register">
        <bitfield id="LEASCITFLG" description=" LEA_SC instruction handshake synchronization type flag " begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="LEASCITFLG_0" value="0x0" description="LEA-SC command without any further indication"/>
            <bitenum id="LEASCITFLG_1" value="0x1" description="LEA-SC command with explicit result update"/>
            <bitenum id="LEASCITFLG_2" value="0x2" description="LEA-SC command with interrupt upon completion"/>
            <bitenum id="LEASCITFLG_3" value="0x3" description="LEA-SC command with interrupt and explicit result update"/>
        </bitfield>
        <bitfield id="LEASCCMD" description=" These bits represent the LEA_SC command to be invoked. See also the command table" begin="9" end="2" width="8" rwaccess="R/W">
            <bitenum id="SUSPEND" value="0x0" description="Suspends ongoing action an enters Ready"/>
            <bitenum id="RESUME" value="0x2" description="Resumes an previously suspended command execution"/>
            <bitenum id="FFTCOMPLEXFIXEDSCALING" value="0x4" description="Complex FFT on 16 bit fractional numbers fix scaling"/>
            <bitenum id="FIR" value="0x6" description="Real FIR on 16 bit fractional numbers"/>
            <bitenum id="POLYNOMIAL" value="0x8" description="Real vector polynomial calculations 16 args all fractional"/>
            <bitenum id="FFT" value="0xA" description="Real FFT-extension on 16 bit fractional numbers"/>
            <bitenum id="POLYNOMIALLONG" value="0xC" description="Real vector polynomial calculations 32 bit args all fractional"/>
            <bitenum id="MPYMATRIXROW" value="0xD" description="Real row oriented matrix multiply"/>
            <bitenum id="MPYMATRIX" value="0xF" description="Real matrix multiply 16 with 16 to 16 bit fractional"/>
            <bitenum id="ADDMATRIX" value="0x10" description="Real point wise matrix add of 16 and 16 to 16 bit number vector"/>
            <bitenum id="MAXMATRIX" value="0x11" description="Real maximum value and position of 16 bit matrices"/>
            <bitenum id="MINMATRIX" value="0x12" description="Real minimum value and position of 16 bit matrices"/>
            <bitenum id="IIRBQ1" value="0x13" description="Real second order biquad using DF1 with 16 bit fractional"/>
            <bitenum id="MAC" value="0x15" description="Real matrix MAC short with 16Bt to 16B fract"/>
            <bitenum id="DEINTERLEAVEEVENEVEN" value="0x16" description="Split 16B vector even to even words"/>
            <bitenum id="DEINTERLEAVEEVENODD" value="0x17" description="Split 16Bt vector even to odd words"/>
            <bitenum id="DEINTERLEAVEODDEVEN" value="0x18" description="Split 16B vector odd to even words"/>
            <bitenum id="DEINTERLEAVEODDODD" value="0x19" description="Split 16B vector odd to odd words"/>
            <bitenum id="MACCOMPLEXMATRIX" value="0x1A" description="Complex Dot Product"/>
            <bitenum id="MACCOMPLEXCONJUGATEMATRIX" value="0x1B" description="Complex conjugate Dot Product"/>
            <bitenum id="SUBMATRIX" value="0x1C" description="Real point wise matrix Subtraction of 16 and 16 to 16 bit"/>
            <bitenum id="MPYLONGMATRIX" value="0x1D" description="Real point wise matrix multiply 32 with 32 to 32 bit fractional"/>
            <bitenum id="MPYCOMPLEXMATRIX" value="0x1E" description="Complex point wise matrix multiply complex with complex"/>
            <bitenum id="ADDLONGMATRIX" value="0x1F" description="Real point wise matrix add of 32 and 32 to 32 bit number"/>
            <bitenum id="MOVELONGLIST" value="0x20" description="List move 32 to 32 bit"/>
            <bitenum id="BITREVERSECOMPLEXEVEN" value="0x21" description="Complex bit reversal for 16 bit fractional numbers even"/>
            <bitenum id="BITREVERSECOMPLEXODD" value="0x22" description="Complex bit reversal for 16 bit fractional Numbers odd"/>
            <bitenum id="IIRBQ2EXTENDED" value="0x24" description="Real second order biquad using DF2 with 16 bit fractional, extended to include bias and intermediate state min/max"/>
            <bitenum id="FFTCOMPLEXLONG" value="0x27" description="Complex FFT on 32B bit fractional numbers, fix scaling"/>
            <bitenum id="FFTLONG" value="0x29" description="Real FFT-extension on 32 bit fractional numbers"/>
            <bitenum id="BITREVERSECOMPLEXLONGEVEN" value="0x2B" description="Complex bit reversal for 32 bit fractional numbers even"/>
            <bitenum id="BITREVERSECOMPLEXLONGODD" value="0x2D" description="Complex bit reversal for 16 bit fractional numbers odd"/>
            <bitenum id="POLYNOMIALSCALAR" value="0x2F" description="Scalar Polynomial for math on 32bit fractional"/>
            <bitenum id="FFTCOMPLEXAUTOSCALING" value="0x30" description="Complex FFT on 16B bit fractional numbers with auto scaling for enhanced accuracy"/>
            <bitenum id="FIRLONG" value="0x32" description="Real FIR on 32 bit fractional numbers"/>
            <bitenum id="MACLONGMATRIX" value="0x34" description="Real block MAC on 32B fractional numbers"/>
            <bitenum id="SUBLONGMATRIX" value="0x35" description="Real point wise matrix Subtraction of 32 and 32 to 32 bit"/>
            <bitenum id="MAXLONGMATRIX" value="0x36" description="Real maximum value and position of signed 32B matrices"/>
            <bitenum id="MINLONGMATRIX" value="0x37" description="Real minimum value and position of signed 32B matrices"/>
            <bitenum id="FIRCOMPLEX" value="0x38" description="Complex FIR on 16B fractional numbers"/>
            <bitenum id="MAXUNSIGNEDMATRIX" value="0x3A" description="Real maximum value and position of unsigned 16B matrices"/>
            <bitenum id="MINUNSIGNEDMATRIX" value="0x3B" description="Real minimum value and position of unsigned 32B matrices"/>
            <bitenum id="MACMATRIX" value="0x40" description="Real Matrix MAC on 16B fractional"/>
            <bitenum id="MAX" value="0x41" description="Vector maximum on 16B signed numbers"/>
            <bitenum id="MIN" value="0x42" description="Vector minimum on 16B signed numbers"/>
            <bitenum id="MAXUNSIGNED" value="0x43" description="Vector maximum on 16B unsigned numbers"/>
            <bitenum id="MINUNSIGNED" value="0x44" description="Vector minimum on 16B unsigned numbers"/>
            <bitenum id="MAXUNSIGNEDLONGMATRIX" value="0x45" description="Matrix maximum on 32B unsigned numbers"/>
            <bitenum id="MINUNSIGNEDLONGMATRIX" value="0x46" description="Matrix minimum on 32B unsigned numbers"/>
            <bitenum id="IIRBQ2" value="0x47" description="Real second order biquad using DF2 with 16 bit fractional"/>
            <bitenum id="FIRCOMPLEXLONG" value="0x49" description="Complex FIR on 32B fractional numbers"/>
            <bitenum id="DEINTERLEAVELONG" value="0x4B" description="Split Function on 32B Vectors/Matrices"/>
            <bitenum id="WINDOW" value="0x4C" description="In-place symmetrical window on 16B fractional numbers"/>
            <bitenum id="MAC3" value="0x4D" description="Vector MAC at three points, real 16-bit with 32-bit result"/>
            <bitenum id="SCALEDMAC" value="0x4E" description="Scaled vector multiply and accumulate (MAC)"/>
            <bitenum id="SCALEDFIR" value="0x4F" description="Scaled FIR, 16-bit real fractional numbers"/>
        </bitfield>
        <bitfield id="LEASCCTX" description=" Command context: This bit field may be set by the user together with invoking a command. This bit field is saved on SUSPEND; and restored from LEA_SC Stack on RESUME. This bit field is used by SW to associate or synchronize LEA_SC commands to a certain tasks and IDs." begin="31" end="20" width="12" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="LEASCIFGSET" width="32" offset="0x70" internal="0" description="Interrupt Flag and Set Register">
        <bitfield id="LEASCCOVLIS" description="LEA_SC command overflow interrupt flag " begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LEASCCOVLIS_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LEASCCOVLIS_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="LEASCTIS" description="LEA_SC timer interrupt flag " begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LEASCTIS_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LEASCTIS_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="LEASCOORIS" description="LEA_SC out of address range interrupt flag. " begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LEASCOORIS_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LEASCOORIS_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="LEASCSDIIS" description="LEA_SC scalar data inconsistency interrupt flag " begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="LEASCSDIIS_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LEASCSDIIS_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="LEASCPMCMDIS" description=" PMCMD as soon hardware trigger is avail. Peripheral memory triggered Command completed interrupt flag. " begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="LEASCPMCMDIS_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LEASCPMCMDIS_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
    </register>
    <register id="LEASCIE" width="32" offset="0x74" internal="0" description="Interrupt Enable Register">
        <bitfield id="LEASCCOVLIE" description="LEA_SC command overflow interrupt enable " begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LEASCCOVLIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="LEASCCOVLIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="LEASCTIE" description="LEA_SC timer event interrupt enable " begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LEASCTIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="LEASCTIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="LEASCOORIE" description="LEA_SC out of address range interrupt enable. " begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LEASCOORIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="LEASCOORIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="LEASCSDIIE" description="LEA_SC scalar data inconsistency interrupt enable " begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="LEASCSDIIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="LEASCSDIIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="LEASCPMCMDIE" description=" PMCMD as soon hardware trigger is avail. Peripheral memory triggered Command completed interrupt enable. " begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="LEASCPMCMDIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="LEASCPMCMDIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
    <register id="LEASCIFG" width="32" offset="0x78" internal="0" description="Interrupt Flag and Clear Register">
        <bitfield id="LEASCCOVLIFG" description="LEA_SC command overflow interrupt flag " begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LEASCCOVLIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LEASCCOVLIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="LEASCTIFG" description="LEA_SC timer interrupt flag " begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LEASCTIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LEASCTIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="LEASCOORIFG" description="LEA_SC out of address range interrupt flag. " begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LEASCOORIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LEASCOORIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="LEASCSDIIFG" description="LEA_SC scalar data inconsistency interrupt flag " begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="LEASCSDIIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LEASCSDIIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="LEASCPMCMDIFG" description="PMCMD when hardware trigger is available. Peripheral memory triggered Command completed interrupt flag. " begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="LEASCPMCMDIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="LEASCPMCMDIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
    </register>
    <register id="LEASCIV" width="32" offset="0x7C" internal="0" description="Interrupt Vector Register">
        <bitfield id="LEASCIV" description=" LEA-SC interrupt vector. This is a generated value that can be used as address offset for fast interrupt service routine handling. Reading this register clears the highest pending LEA-SC interrupt (displaying this register with an IDE does not affect its content). Writing to this register clears al pending interrupt flags.This value is always aligned to a 20 bit address offset boundary" begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="COVLIFG" value="0x2" description="LEA command overflow"/>
            <bitenum id="TIFG" value="0x4" description="LEA timer interrupt"/>
            <bitenum id="OORIFG" value="0x6" description="LEA out of range interrupt"/>
            <bitenum id="SDIIFG" value="0x8" description="LEA scalar data inconsistency"/>
            <bitenum id="PMCMDIFG" value="0xA" description="PMCMD complete interrupt"/>
        </bitfield>
    </register>
</module>
